ThuanLeUte/nrf52832-ads1292-fw/app/project/ble_peripheral/ble_app_template/main.c
uint32_t app_time;
ecg_data_t ecg_data;

/* Private function prototypes ---------------------------------------- */
static void timers_init(void);
static void gap_params_init(void);
static void nrf_qwr_error_handler(uint32_t nrf_error);
static void services_init(void);
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt);
static void conn_params_init(void);
static void sleep_mode_enter(void);
static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context);
static void ble_stack_init(void);
static void gatt_init(void);
static void advertising_init(void);
static void log_init(void);
static void power_management_init(void);
static void idle_state_handle(void);
static void advertising_start(void);

static void battery_level_meas_timeout_handler(void * p_context);
static void sensors_meas_timeout_handler(void * p_context);
static void led_blink_timeout_handler(void * p_context);

static void battery_level_update(void);
static void sensors_value_update(void);

static void acs_service_init(void);
static void ecg_service_init(void);
static void sts_service_init(void);
static void mgs_service_init(void);
static void bas_service_init(void);
static void dis_service_init(void);

static void application_timers_start(void);

// Here is where you define the sensor outputs you want to receive
void setReports(void)
{
  NRF_LOG_INFO("Setting desired reports");
  if (!bno085_enable_report(SH2_ACCELEROMETER, 1000))
  {
    NRF_LOG_INFO("Could not enable accelerometer");
  }

  if (!bno085_enable_report(SH2_RAW_ACCELEROMETER, 1000))
  {
    NRF_LOG_INFO("Could not enable accelerometer");
  }
}

/* Function definitions ----------------------------------------------- */
/**
 * @brief Application main function.
 */
int main(void)
{
  g_device.is_device_on = false;

  // Initialize.
  log_init();
  timers_init();
  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();

  bsp_hw_init();

  //sys_button_init();
  //bsp_nand_flash_init();
  //bsp_imu_init();
  //bsp_afe_init();

  //sys_logger_flash_init();

  // Start execution.
  application_timers_start();
  advertising_start();
  bno085_init();

  // Set default mode to record data
  g_device.mode = SYS_MODE_RECORD_DATA;
  setReports();
  delay(1000);

  for (;;)
  {
    NRF_LOG_PROCESS();

    delay(500);

    if (bno085_was_reset())
    {
      setReports();
    }

    if (bno085_get_sensor_event(&sensor_value))
    {
      switch (sensor_value.sensorId)
      {
      case SH2_ACCELEROMETER:
        NRF_LOG_INFO("Accelerometer:");
        NRF_LOG_PROCESS();
        NRF_LOG_INFO(" x: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(sensor_value.un.accelerometer.x))
        NRF_LOG_PROCESS();
        NRF_LOG_INFO(" y: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(sensor_value.un.accelerometer.y))
        NRF_LOG_PROCESS();
        NRF_LOG_INFO(" z: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(sensor_value.un.accelerometer.z))
        NRF_LOG_PROCESS();
        NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
        NRF_LOG_PROCESS();
        break;

      //case SH2_RAW_ACCELEROMETER:
      //  NRF_LOG_INFO("Raw Accelerometer:");
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" x: %d", sensor_value.un.rawAccelerometer.x);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" y: %d", sensor_value.un.rawAccelerometer.y);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" z: %d", sensor_value.un.rawAccelerometer.z);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
      //  NRF_LOG_PROCESS();
      //  break;

      //case SH2_RAW_GYROSCOPE:
      //  NRF_LOG_INFO("Raw Gyro:");
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" x: %d", sensor_value.un.rawGyroscope.x);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" y: %d", sensor_value.un.rawGyroscope.y);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" z: %d", sensor_value.un.rawGyroscope.z);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
      //  NRF_LOG_PROCESS();
      //  break;

      //case SH2_RAW_MAGNETOMETER:
      //  NRF_LOG_INFO("Raw Magnetic Field:");
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" y: %d", sensor_value.un.rawMagnetometer.y);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO(" z: %d", sensor_value.un.rawMagnetometer.z);
      //  NRF_LOG_PROCESS();
      //  NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
      //  NRF_LOG_PROCESS();
        break;
      }
    }
  }
}

/**
 * @brief         Function for assert macro callback.
 *
 * @param[in]     line_num     Line number of the failing ASSERT call.
 * @param[in]     p_file_name  File name of the failing ASSERT call.
 *
 * @attention     None
 *
 * @return        None
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/* Private function definitions --------------------------------------- */
/**
 * @brief         Function for initializing the timer module.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void timers_init(void)
{
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

  // Create timers.
  err_code = app_timer_create(&m_sensors_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              sensors_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);

  err_code = app_timer_create(&m_battery_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              battery_level_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);

  err_code = app_timer_create(&m_led_blink_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              led_blink_timeout_handler);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for the GAP initialization.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void gap_params_init(void)
{
  uint32_t                err_code;
  ble_gap_conn_params_t   gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
                                        (const uint8_t *)DEVICE_NAME,
                                        strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency     = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for handling Queued Write Module errors.
 *
 * @param[in]     nrf_error   Error code containing information about what went wrong.
 *
 * @attention     None
 *
 * @return        None
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}

/**
 * @brief         Function for ACS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void acs_service_init(void)
{
  uint32_t           err_code;
  ble_acs_init_t     acs_init;

